groupmates = [
    {
        "name": "Дмитрий",
        "surname": "Сидоров",
        "exams": ["ООП", "Архитектура ПО", "Базы данных"],
        "marks": [4, 5, 4]
    },
    {
        "name": "Алексей",
        "surname": "Кузнецов",
        "exams": ["Теория алгоритмов", "Сети и протоколы", "Web"],
        "marks": [5, 4, 5]
    },
    {
        "name": "Екатерина",
        "surname": "Новикова",
        "exams": ["Python", "Машинное обучение", "Базы данных"],
        "marks": [5, 5, 4]
    },
    {
        "name": "Андрей",
        "surname": "Смирнов",
        "exams": ["Java", "Архитектура ПО", "Тестирование ПО"],
        "marks": [4, 5, 5]
    },
    {
        "name": "Мария",
        "surname": "Иванова",
        "exams": ["Теория графов", "Алгоритмы и структуры данных", "Web"],
        "marks": [5, 4, 4]
    }
]